app/controllers/items_controller.rb

  def create
  new_item = Item.new(params[:item])

  current_user.items << new_item
---
INSERT INTO "items" ("borrowed", "category", "created_at", "description", "name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def category
  @all = Item.all
---
SELECT "items".* FROM "items"

 def searchresult
    @result = Item.search("name", params[:name])
---
SELECT "items".* FROM "items" WHERE (author LIKE '%Lois%')