app/controllers/users_controller.rb

SELECT "items".* FROM "items" WHERE "items"."user_id" = 10
SELECT "borrows".* FROM "borrows" WHERE "borrows"."item_id" IN (SELECT "items"."id" FROM "items" WHERE "items"."user_id" = 24)
---
def profile
   @items = Item.where(user_id: current_user.id)
  @my_borrows= Borrow.where(user_id: current_user.id)